// 1 задание 1 способ (цикл for)
#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n; // ввод N от 1 до 100

    for (int i = 0; i < n; i++) { // перебор строк
        for (int j = 0; j < n; j++) { // перебор столбцов
            if (i + j < n - 1) { // i+j<n-1 выше побочной диагонали, пишем 0
                cout << 0;
            } else if (i + j == n - 1) { // i+j==n-1 на диагонали, пишем 1
                cout << 1;
            } else { // i+j>n-1 ниже диагонали, пишем 2
                cout << 2;
            }
            // пишем пробел после каждого элемента, кроме последнего в строке
            if (j != n - 1) cout << ' ';
        }
        cout << '\n'; // переход на новую строку
    }
    return 0;
}