// задание 2 способ 1
#include <iostream>
using namespace std;

int main() {
    int n, m, w;
    cin >> n >> m >> w;

    bool g[35][35] = {}; // берем 35 чтобы учесть границы
    while (w--) { // цикл выполняется пока остались грибы
        int r, c; // создаем строку и столбец каждый раз заново
        cin >> r >> c; // вводим координаты следующего гриба
        g[r][c] = true; // ставим метку гриба
    }

    for (int i = 1; i <= n; i++, cout << '\n') // цикл по строкам от 1 до n, каждый раз переходя в след строку
        for (int j = 1; j <= m; j++) { // цикл от 1 до m, перебор n*m клеток поля
            if (g[i][j]) { cout << '*'; continue; } // если гриб в нужной клетке то пишем * и переходим к след j

            int cnt = 0; // счетчик грибов-соседей, обнуляем для каждой пустой клетки
            for (int di = -1; di <= 1; di++) // 3 строки вокруг
                for (int dj = -1; dj <= 1; dj++) // 3 столбца вокруг
                    cnt += g[i + di][j + dj]; // true - 1, false - 0

            cout << cnt; // вывод соседей грибов для пустой клетки
        }
}