#include <iostream>
#include <string>
using namespace std;

int main() {
    int x, n;
    cin >> x >> n; // ввод первого числа и количество нужных чисел

    string s = to_string(x); // перевод в str для s.size

    for (int step = 1; step < n; step++) { // 1 элемент пропускаем тк он уже есть
        string t;
        for (int i = 0; i < (int)s.size(); ) { // идем по строке s
            int cnt = 0; // счетчик сколько раз подряд идет текущая цифра
            char c = s[i]; // запоминаем цифру текущей группы
            while (i < (int)s.size() && s[i] == c) { // пока не конец строки и цифра та же
                cnt++; // увеличивает счетчик повторов 
                i++; // переход к след символу
            }
            t += to_string(cnt);
            t += c;
            // записываем сколько раз повторяется цифра + какая именно цифра
        }
        s = t; // записываем результат в s для след шага
    }

    cout << s << '\n';
}